{"config": [{"config": {"go_backwards": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "kernel_regularizer": null, "recurrent_regularizer": null, "stateful": false, "activation": "tanh", "trainable": true, "recurrent_constraint": null, "name": "lstm_1", "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "dtype": "float32", "batch_input_shape": [null, 32, 30], "return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"go_backwards": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "use_bias": true, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activation": "tanh", "trainable": true, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "return_sequences": false, "bias_constraint": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_2", "rate": 0.2, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "trainable": true, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 2, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.9", "backend": "tensorflow", "class_name": "Sequential"}